<%@ page language="java" import="java.util.*" contentType="text/html; charset=utf-8"%>
<h4>1、研究目标</h4><br>
<p>针对复杂计算系统的系统管理和优化问题，以计算系统的系统日志数据为研究对象，研究基于日志的事件挖掘方法，重点突破事件提取方法、事件摘要和可视化方法，以及事件挖掘方法等关键技术；进一步地研究上述关键技术的综合实施方法，构建一个事件挖掘试验平台；并以云计算场景下集群系统日志和网络设备日志为应用背景，开展实验验证，优化综合解决方案，为设计更通用的事件挖掘平台奠定基础。</p><br><br>
<h4>2、研究内容</h4><br>
<h5>1）	基于数据挖掘的事件提取方法</h5>
<p>针对日志文件的特点，研究基于聚类方法、或基于分类算法的事件提取方法，设计并实现基于数据挖掘的日志解析器，实现准确的事件提取。</p>
<h5>2）	事件摘要及其可视化</h5>
<p>研究一种事件关系网络的事件摘要方法，从事件模式的角度，捕获同类型事件和不同类型事件之间的时序关系；进一步地，为了平衡摘要的准确性和简洁性，研究基于最短描述长度原则的事件摘要优化方法，用于描述庞大复杂的事件日志信息；研究基于事件关系网络的可视化方法，以易于理解的方式帮助系统管理员掌握系统运行状态及其变化。</p>
<h5>3）	事件模式挖掘方法研究</h5>
<p>深入分析不同事件模式，如T-pattern，罕见事件模式、事件依赖模式，事件突变等的特点，研究和实现相应的事件模式挖掘方法；设计和实现事件模拟器，用于事件模式挖掘算法验证和分析。</p>
